Tekla Open API Reference for Tekla Structures 2025
Bolt.Representation Enumeration
 The bolt representations.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Representation
Public Enumeration Representation
Members
Member name | Value | Description
Solid | 1 |  The solid representation.
ExactSolid | 9 |  The exact solid representation.
Symbol | 2 |  The symbol representation.
Symbol2 | 4 |  The second symbol representation.
Symbol3 | 5 |  The third symbol representation.
DINSymbol | 7 |  The DIN symbol representation.
UserDefined | 8 |  The user defined representation.
See Also
Reference
Tekla.Structures.Drawing Namespace